{"id":1,"gamerank":"1","name":"Persona 5 Royal","reviewsite1":"IGN","review1":" \"Person 5 Royal is a living master class in how to take an already amazing game and amp it up to the next level. It’s not just a standard “game of the year” edition with some extra content thrown in on the side. Just about everything in Atlus 2016 (2017 in the US) JRPG magnum opus has been honed, polished, and expanded in some meaningful and positive way. Across more than 130 hours of adventuring through urban Tokyo and the surreal realms of the human mind, the amount of love and attention to detail hiding around each old and new twist in the story left me in awe.\" - T.J.Haher IGN","rating1":"10","link1":"https://www.ign.com/articles/persona-5-royal-review","reviewsite2":"Game Spot","review2":" \"The extended version, Persona 5 Royal, brings the heat all over again. But beyond a plethora of superb gameplay refinements and features that improve an already-rich RPG comes a momentous new story arc seeded within the original narrative and paid off in full by the end. It delivers something genuinely surprising, leading to awe-inspiring moments and emotional conclusions that recontextualize what I thought the game was. Through its lengthy 120-hour runtime, Persona 5 Royal proves itself as the definitive version of a modern classic.\" - Micheal Higham GameSpot","rating2":"10","link2":"https://www.gamespot.com/reviews/persona-5-royal-review-hearts-of-gold/1900-6417444/","reviewsite3":"Euro Gamer","review3":" \"Persona 5 Royal brands itself as the definitive version of the game, and introduces an extensive list of improvements - if you've played Persona 5 before, you'll definitely notice how P-Studio worked to fix a few common gripes. New items help in combat, such as talismans that buff several stats at once, more food and drink that replenishes SP and many new accessories, among them rings you can put on your team members so they can use spells they normally don't have access to.\" - Malindy Hetfeld EuroGamer  ","rating3":"3/5","link3":"https://www.eurogamer.net/articles/2020-03-31-persona-5-royal-review","editorialreview":"I went into this game not knowing anything about it, from the get go I was hooked on to the story as there was so much mystery and unknown details. I really liked the battle mechanics of the game and the leveling system."}
{"id":2,"gamerank":"2","name":"Fortnite Battle Royale","reviewsite1":"IGN","review1":" \"Stiff arming its way through the crowded battle royale genre, Fortnite Battle Royale sets itself apart by trading the traditional, bland military simulation vibe with vivid colors and an outstanding, freeform building system that’s unlike anything else in competitive multiplayer games.As its name suggests, Fortnite Battle Royale fits so neatly into the battle royale genre that blew up last year that the basic description sounds as standard as you can get: Up to 100 players are dropped onto a large but constantly shrinking map with the goal of gathering weapons and gear to become the last person or team left standing. But if you look just a little closer, it can’t be mistaken for any other game because the vehicle you’re skydiving out of is, inexplicably, a flying party bus – a nice change of pace from a drab military plane – and the place you land is a giant, beautifully colorful island, instead of a realistic landscape, surrounded by a violent storm.\" - Austen Golsen IGN","rating1":"9.6","link1":"https://www.ign.com/articles/2018/03/27/fortnite-battle-royale-review","reviewsite2":"Game Spot","review2":" \"For a game that was long in development as a cooperative horde-based shooter, the conspicuous and relatively quick addition of battle royale to Fortnite seemed to be a move to capitalize on a trend. However, its seemingly simple building system and loose shooting mechanics not only set it apart from other games built on the same premise, but work extremely well to make a uniquely chaotic and surprisingly deep deathmatch experience.\" - Micheal Higham GameSpot ","rating2":"8","link2":"https://www.gamespot.com/reviews/fortnite-battle-royale-review-laying-the-foundatio/1900-6416891/","reviewsite3":"Digital Trends","review3":" \"Fortnite is not so much a game at this point; it’s a cultural touchstone, a steadfast staple of society that doesn’t seem to be going anywhere, almost two years after its arrival. What originally started as a free-to-play offshoot of a disappointing zombie tower defense game has morphed into the premier example of live-service experience. Fortnite as it stands today is much different than it was at launch, and it’s even much different than it was few months ago.\" - Steven Petite Digital Trends ","rating3":"8","link3":"https://www.digitaltrends.com/game-reviews/fortnite-battle-royale-review/","editorialreview":"This game is an instant classic. When the game released there was so much hype around it and that same hype still exists today. This game is a must have. You can play by yourself or play and have fun with your friends."}
{"id":3,"gamerank":"3","name":"Horizon Zero Dawn","reviewsite1":"IGN","review1":" \"There’s something about being dropped into a brand new game world and finding it to be dense with deeply considered lore, terrifyingly aggressive creatures, and tantalizing questions that leaves an indelible mark on the memory. Horizon Zero Dawn is one of those games, and it carves out a unique identity within the popular action-roleplaying genre. Coupled with wonderfully flexible combat and a story that touches on unexpectedly profound themes, I found it hard to tear myself away from Horizon even after I’d finished its main campaign some 40 odd hours later.\"  -Lucy O'Brien IGN","rating1":"9.3","link1":"https://www.ign.com/articles/2017/02/20/horizon-zero-dawn-review","reviewsite2":"Game Spot","review2":" \"This is the first departure from the Killzone series for developer Guerrilla Games, and though you might think the team took a risk by stepping out of its FPS comfort zone to create a third-person open-world action game, you'd never know it was their first rodeo. For every minor imperfection, there's an element of greatness that recharges your desire to keep fighting and exploring Zero Dawn's beautiful and perilous world. Guerrilla Games has delivered one of the best open-world games of this generation, and redefined its team's reputation in the process.\" - Peter Brown GameSpot","rating2":"9","link2":"https://www.gamespot.com/reviews/horizon-zero-dawn-review/1900-6416620/","reviewsite3":"Trusted Reviews","review3":" \"I didn’t expect Horizon Zero Dawn to be this good. I doubt I’ll be the only one saying they were surprised that the Killzone developer has been able to deliver a game with such breadth, depth, and consistently rewarding gameplay.\" - Brett Phipps Trusted Reviews","rating3":"4.5/5","link3":"https://www.trustedreviews.com/reviews/horizon-zero-dawn","editorialreview":"The scenery in this game is breatking, you could spend hours looking at the landscape in this game. this combined with the story and combat makes this a really good and enjoyable game."}
{"id":4,"gamerank":"4","name":"Uncharted 4","reviewsite1":"IGN","review1":" \"In amongst its frantic combat, slick parkour, and outrageous action choreography, Uncharted 4: A Thief’s End achieves something wonderful: maturity. This is less a breezy lad’s tale revelling in fortune and glory and more a story about the lads when they’re all grown up, bolstered by an equally developed graphics engine and career-high performances from its cast. A surprisingly assured set of multiplayer modes ices the cake.\" - Lucy O'Brien IGN","rating1":"9","link1":"https://www.ign.com/articles/2016/05/11/uncharted-4-a-thiefs-end-review","reviewsite2":"Game Spot","review2":" \"Uncharted 4 is a challenge to the medium. In its writing, in its design, in its understanding of what makes games unique, Uncharted 4 is something to aspire to. It's a shining example. And we'll be talking about it for years to come.\" - Mike Mahardy GameSpot","rating2":"10","link2":"https://www.gamespot.com/reviews/uncharted-4-a-thiefs-end-review/1900-6416423/","reviewsite3":"Trusted Reviews","review3":" \"I can’t describe Uncharted 4 as the perfect game. The single player campaign takes a while to reach a state of near-perfection, then throws in a few too many wearying battles in its tremendously exciting final run. It’s bloody close, though, and only enhanced by its multiplayer modes. Sometimes, A Thief’s End seems like the last of the great mainstream blockbusters, made to thrill and move vast audiences on an epic scale. I hope not, and that Naughty Dog proves me wrong with its next project. Perfect or not, it’s one of the best games I’ve ever played. \" - Stuart Andrews Trusted Reviews","rating3":"4.5/5","link3":"https://www.trustedreviews.com/reviews/uncharted-4","editorialreview":"The story telling in this game is amazing. It gives the series a proper ending that makes you fell both happy and satisfied"}
{"id":5,"gamerank":"5","name":"Minecraft","reviewsite1":"IGN","review1":" \"No other video game has unleashed my creativity like Minecraft. I've spent countless hours chipping away at blocks, gathering the necessary materials to complete the next masterpiece that would otherwise only occupy my mind's eye. I've also spent just as many hours exploring, spelunking and slashing my way through monsters with bravado. My character – my entire Minecraft world – constantly evolves into whatever I want it to be. I tell my own stories, I write my own destiny and I bring my fantasies to life one brick at a time.\" - Anthony Gallegos IGN","rating1":"9","link1":"https://www.ign.com/articles/2011/11/24/minecraft-review","reviewsite2":"Game Spot","review2":" \"With the amount of activities available, there's no telling which ones you will say are your favorite, and the reason you have to keep coming back time after time. Hunting down elusive diamonds in twisting catacombs is thrilling, but maybe you find that crafting a boat and lazily floating down a river to unknown shores to be more gratifying. Regardless of how you derive your enjoyment, Minecraft: PlayStation 4 Edition has countless hours of it, whether you explore its lands alone or alongside some good friends.\" - Cameron Woolsey GameSpot","rating2":"9","link2":"https://www.gamespot.com/reviews/minecraft-playstation-4-edition-review/1900-6415882/","reviewsite3":"PC gamer","review3":" \"Minecraft, as if you've never heard of it, as if we haven't been telling you to play it for years, as if we didn't already give it Game of the Year in 2010, is a game about building things out of blocks with your friends.\" - Jaz McDougall PC Gamer","rating3":"96/100","link3":"https://www.pcgamer.com/minecraft-review/","editorialreview":"This game is unbelievable, There is so much you can do in this game. Build incredible structures, go on crazy adventures or dangerous fight monster. This game is a must have. you can play with friends or by yourself, either way it will still be a blast."}
{"id":6,"gamerank":"6","name":"Star Wars Jedi: Fallen Order","reviewsite1":"IGN","review1":" \"Jedi: Fallen Order pushes all the right buttons for a Star Wars action-adventure. It’s a genre remix that samples the combat and exploration of a lightened-up Dark Souls and the action and energy of Uncharted, and that works out to be a great fit for the return of the playable Jedi.\" - Dan Stapleton IGN","rating1":"9","link1":"https://www.ign.com/articles/2019/11/15/star-wars-jedi-fallen-order-review","reviewsite2":"Game Spot","review2":" \"Star Wars games often feel estranged from the franchise that spawned them. Video games have gotten very good at capturing the aesthetic of Star Wars--the cold metallic angles of Imperial architecture, the powerful hum of a lightsaber, the electric snap of a blaster bolt hitting home--but can struggle to get beneath the surface. It's the rare Star Wars game that reaches beyond how Star Wars looks to explore what Star Wars is really about.\" - Phil Hornshaw GameSpot","rating2":"8","link2":"https://www.gamespot.com/reviews/star-wars-jedi-fallen-order-review-a-good-feeling-/1900-6417364/","reviewsite3":"Trusted Reviews","review3":" \"Star Wars Jedi: Fallen Order is far from a masterpiece, but to say it could’ve been one without some of its basic flaws may not be so far fetched. As it is, you can look past the tame story and inconvenient bugs and instead revelling in joyous combat, awe-inducing cinematics and fluid platforming.\" - Adam Speight Trusted Reviews","rating3":"4/5","link3":"https://www.trustedreviews.com/reviews/star-wars-jedi-fallen-order","editorialreview":"This game is a perfect game for a star wars fan. there is a good balence of lore, stroy telling and fighting. the fighting feels good and smooth and is pleasent to look at."}
{"id":7,"gamerank":"7","name":"Kingdom Hearts 3","reviewsite1":"IGN","review1":" \"This new set of movie-quality Disney worlds are almost all delights to explore. The sheer amount of treasures to collect and hidden Mickey emblems to discover really highlights the scale and detail of each world. They also introduce some fun gameplay options, including the chance to control toy mechs and even pilot your own ship on the high seas.\" - Jonathon Dornbush IGN","rating1":"8.7","link1":"https://www.ign.com/articles/2019/01/24/kingdom-hearts-3-review-ps4-xbox-one","reviewsite2":"Game Spot","review2":" \"Like every game in the series before it, Kingdom Hearts 3 begins by playing its theme, Dearly Beloved, over the title screen. Composed by acclaimed musician Yoko Shimomura, it perfectly captures the sentimentality at the heart of the series. The song is at once tender and melancholic, wistful and adventurous, somber and uplifting--a reminder of a history that'll leave longtime fans dewy-eyed. I wish I could properly convey the impact of hearing it, but the best I can do is to say that it is overwhelming.\" - Tamoor Hussain GameSpot","rating2":"8","link2":"https://www.gamespot.com/reviews/kingdom-hearts-3-review-clear-eyes-full-hearts/1900-6417074/","reviewsite3":"Trusted Reviews","review3":" \"I loved my time with Kingdom Hearts 3, embracing its melodramatic storytelling, whimsical selection of worlds and spectacular combat right until the very end.\" - Jade King Trusted Reviews","rating3":"4.5/5","link3":"https://www.trustedreviews.com/reviews/kingdom-hearts-3","editorialreview":"On the surface this game looks like a kids game with all the disney characters but the story behind this game is very intersesting an intriguing but it is very complicated for a new comer and may take some outside research to understand what is happeing."}
{"id":8,"gamerank":"8","name":"Marvels Spider-Man","reviewsite1":"IGN","review1":" \"At its core, Insomniac Games’ new adventure strives to make you feel like Spider-Man. And, thankfully, Marvel’s Spider-Man on PS4 succeeds at nearly every swing across Manhattan’s rooftops. I was left delighted at nearly every step of its 15-hour adventure thanks to a surprisingly deep tale that mines the plights of both Spider-Man and Peter Parker to great emotional success. Underpinning that engrossing narrative is an excellent set of webswinging mechanics, which -- combined with fun gadgets and plenty of puns -- makes for thrilling action in both the massive setpieces and in the quiet, confined corridors of tense sequences. Insomniac’s first foray into the realm of Marvel superheroes is a continually exciting adventure whose open world and combat are only occasionally caught up in a web of overly familiar trappings.\" - Janathon Dornbush IGN","rating1":"8.7","link1":"https://www.ign.com/articles/2018/09/04/marvels-spider-man-ps4-review","reviewsite2":"Game Spot","review2":" \"Minor shortcomings don't detract from Insomniac's achievement in creating a game that feels like an authentic interpretation of a beloved creation. The feeling of embodying Spidey and using his abilities is astonishing, and the time spent on exploring its major characters help make its story feel heartfelt, despite superhero bombast. There have been open-world Spider-Man games before, but none so riveting and full of personality, none that explore and do justice to this many facets of the universe. Insomniac has created a superior Spider-Man experience that leaves a lasting impression, one that has you longing for just one more swing around New York City, even after the credits roll.\" - Edmond Tran GameSpot","rating2":"9","link2":"https://www.gamespot.com/reviews/marvels-spider-man-ps4-review-amazing-fantasy/1900-6416975/","reviewsite3":"Trusted Reviews","review3":" \"Marvel’s Spider-Man has a surprising amount to say for itself and continues Sony’s run of best-in-show first party exclusives. Comic book fans will fall in love with Insomniac’s loving rendition of the webhead’s Manhattan, but fans expecting the next God of War might find themselves a little disappointed. \" - Jake Tucker Trusted Reviews","rating3":"4/5","link3":"https://www.trustedreviews.com/reviews/spider-man-ps4","editorialreview":"This is a very good spiderman game. The mechanics of the friendly neighbourhood spiderman feel really smooth and the actions flow into each other. The story is mediocre but the gameplay is good."}
{"id":9,"gamerank":"9","name":"Rocket League","reviewsite1":"IGN","review1":" \"Rocket League’s colorfully absurd cars-playing-sports concept works so well because the energy of its arcadey gameplay meshes with its deep team-based strategy and variety of modes. It’s exceedingly rare to find a multiplayer game that’s welcoming and approachable for new players and so intricate that the best players can earn a living by mastering its depths. Rocket League is a golden example of turning a good idea into something truly amazing.\" - Brandin Tyrrel IGN","rating1":"9.3","link1":"https://www.ign.com/articles/2017/12/06/rocket-league-review","reviewsite2":"Game Spot","review2":" \"The joy of Rocket League rests on the countless plans that are conceived and discarded every other second in any given match. Trying to predict where and how the ball will bounce next is a game within the game. Despite the use of cars, Rocket League emulates the emotional surges typical of The Beautiful Game, such as the rush of an unexpected fast break or a well-timed header into a goal. With Rocket League, the promising concept of combining two wonderful things--cars and soccer--is equally magnificent in execution. You can't say the same thing about, say, combining cake and fruit to make fruitcake, as the comedian Jim Gaffigan observed.\" - Miguel Concepcion GameSpot","rating2":"9","link2":"https://www.gamespot.com/reviews/rocket-league-review/1900-6416186/","reviewsite3":"PlayStation LifeStyle","review3":" \"Simply put, Rocket League is one of the best titles on PlayStation 4. It manages to flawlessly blend fast-paced racing with a sport that is familiar to millions. The depth is there to keep players coming back for years to come, and Psyonix has done a masterful job in creating one of the best multiplayer experiences yet.\" - Tyler Treese PlayStation LifeStyle","rating3":"9","link3":"https://www.playstationlifestyle.net/2015/07/10/rocket-league-review-hat-trick-ps4/#/slide/1","editorialreview":"This is a fun game to play with your friends, you can have alot of fun, but if your looking for something more, the competitive side of rocket league is very strong and the game has many hard to master mechanics that will help you win in games."}
{"id":10,"gamerank":"10","name":"Fifa 20","reviewsite1":"IGN","review1":" \"Volta is a significant addition to FIFA and while it doesn’t all hit the right notes, it’s a largely enjoyable way to play a wealth of content, including a story mode that’s more concise and engaging than The Journey. Elsewhere, improvements have been made to the core FIFA 20 experience, especially when it comes to defending, but overall controlling the ball feels less consistently fluid. For someone not attracted by the allure of Volta, the stilted pace, coupled with a neglect of offline modes such as Career, make it FIFA 20 an adequate but underwhelming entry into the series. \" - Simon Cardy IGN","rating1":"7.8","link1":"https://www.ign.com/articles/2019/09/19/fifa-20-review","reviewsite2":"Games Spot","review2":" \"Flawed and iterative, but comforting, complete, and compelling, FIFA 20 is as frustrating and as essential as ever. The Journey and FIFA Street will continue to be missed, but Volta offers a genuinely different option for those who want to dip in and out across FIFA's smorgasboard of game types, while Ultimate Team continues its route to world domination. It's just a shame Career Mode continues to stagnate--even if EA has finally remembered it exists.\" - Oscar Dayus GameSpot","rating2":"8","link2":"https://www.gamespot.com/reviews/fifa-20-review-premier-league/1900-6417313/","reviewsite3":"Trusted Reviews","review3":" \"FIFA 20 remains a gorgeous and fun-to-play football game that’s as addictive as ever. The addition of Volta adds some much-needed variety and the quick matches filled with skills and elaborate game celebrations are fun. I’m not sold on all the gameplay tweaks, however, and the additions to Career mode feel slightly dull. Still, if you’ve picked up FIFA every year then you’re most likely going to like what’s on offer here, even if the package feels very familiar.\" - Max Parker Trusted Reviews","rating3":"4/5","link3":"https://www.trustedreviews.com/reviews/fifa-20","editorialreview":"This is like most fifa games, there isnt much new. the gameplay feels smoother but there are still too many glitches and the servers arent always the best but you can have alot of fun on this as there are alot of things you can do."}
